ultraedit/ultraedit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-07 周五 09:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>UltraEdit</title>
<meta name="generator" content="Org mode" />

<link rel="stylesheet" type="text/css" href="../style/my-org-worg.css" />

</head>
<body>
<div id="content">
<h1 class="title">UltraEdit</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0660b1b">1. 安装</a>
<ul>
<li><a href="#orgc256266">1.1. Windows平台</a></li>
<li><a href="#org3649c43">1.2. 注冊ftp模块</a></li>
</ul>
</li>
<li><a href="#orgfb18cd9">2. 常用配置</a>
<ul>
<li>
<ul>
<li><a href="#org47cc1e4">2.0.1. 现代菜单</a></li>
<li><a href="#orgaf4088c">2.0.2. 自定义快速访问工具栏</a></li>
<li><a href="#org91989ac">2.0.3. 在Ribbon上显示</a></li>
<li><a href="#org1f5d466">2.0.4. 最小化Ribbon</a></li>
<li><a href="#org5512498">2.0.5. 取消文件保存自动备份bak文件</a></li>
<li><a href="#org2294251">2.0.6. 设置主题</a></li>
<li><a href="#org36fc35c">2.0.7. 添加右键菜单</a></li>
<li><a href="#org7e4eda1">2.0.8. 文件修改自动加载</a></li>
<li><a href="#org4c7b35e">2.0.9. 设置缩进为4空格(针对每个编程语言)</a></li>
<li><a href="#org65b68dc">2.0.10. 修改默认utf-8编码</a></li>
<li><a href="#orgca0d25e">2.0.11. 左侧显示文件视图</a></li>
<li><a href="#orgae26170">2.0.12. 新建文件类型</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge075d4d">3. 常用快捷键</a></li>
</ul>
</div>
</div>


<div id="outline-container-org0660b1b" class="outline-2">
<h2 id="org0660b1b"><span class="section-number-2">1</span> 安装</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgc256266" class="outline-3">
<h3 id="orgc256266"><span class="section-number-3">1.1</span> Windows平台</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>主程序安装</li>
</ul>
<pre class="example">
官网下载对应平台的最新安装包，

选择好安装路径，傻瓜式一路回车法安装
</pre>
</div>
</div>

<div id="outline-container-org3649c43" class="outline-3">
<h3 id="org3649c43"><span class="section-number-3">1.2</span> 注冊ftp模块</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
cd C:\Local\UltraEdit ( 切換到UltraEdit的安裝目錄下 )
regsvr32.exe  wodFtpDLX64.dll
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb18cd9" class="outline-2">
<h2 id="orgfb18cd9"><span class="section-number-2">2</span> 常用配置</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org47cc1e4" class="outline-4">
<h4 id="org47cc1e4"><span class="section-number-4">2.0.1</span> 现代菜单</h4>
<div class="outline-text-4" id="text-2-0-1">
<pre class="example">
工具栏右击 -&gt; 工具栏/菜单模式 -&gt; 选择现代菜单，传统菜单是指以前老版本的菜单布局方式
</pre>
</div>
</div>

<div id="outline-container-orgaf4088c" class="outline-4">
<h4 id="orgaf4088c"><span class="section-number-4">2.0.2</span> 自定义快速访问工具栏</h4>
<div class="outline-text-4" id="text-2-0-2">
<pre class="example">
右击标题栏空白区 -&gt; 定义快速访问工具栏 -&gt; 都移除
</pre>
</div>
</div>

<div id="outline-container-org91989ac" class="outline-4">
<h4 id="org91989ac"><span class="section-number-4">2.0.3</span> 在Ribbon上显示</h4>
<div class="outline-text-4" id="text-2-0-3">
<pre class="example">
左上角有个小三角，点击在Ribbon上显示
</pre>
</div>
</div>

<div id="outline-container-org1f5d466" class="outline-4">
<h4 id="org1f5d466"><span class="section-number-4">2.0.4</span> 最小化Ribbon</h4>
<div class="outline-text-4" id="text-2-0-4">
<pre class="example">
标题栏右击最小化Ribbon,Ribbon 功能区精简模式
</pre>
</div>
</div>

<div id="outline-container-org5512498" class="outline-4">
<h4 id="org5512498"><span class="section-number-4">2.0.5</span> 取消文件保存自动备份bak文件</h4>
<div class="outline-text-4" id="text-2-0-5">
<pre class="example">
 高级 -&gt; 设置 -&gt; 文件处理 -&gt; 备份 -&gt; 不备份
</pre>
</div>
</div>

<div id="outline-container-org2294251" class="outline-4">
<h4 id="org2294251"><span class="section-number-4">2.0.6</span> 设置主题</h4>
<div class="outline-text-4" id="text-2-0-6">
<pre class="example">
布局 -&gt; 主题 -&gt; 选择自己喜欢的主题（Classic）
</pre>
</div>
</div>

<div id="outline-container-org36fc35c" class="outline-4">
<h4 id="org36fc35c"><span class="section-number-4">2.0.7</span> 添加右键菜单</h4>
<div class="outline-text-4" id="text-2-0-7">
<pre class="example">
方法1：
高级 -&gt; 设置 -&gt; 文件关联 -&gt; 与资源管理器集成(这种方式感觉不好)

方法2(修改注册表)：
cmd -&gt; regedit -&gt; HKEY_CLASSESS_ROOT -&gt; * -&gt;Shell 

新建节点UltraEdit安装的目录名字）

该项下新建两个字段
1 新建字符串 Icon (修改值为安装路径 C:\Local\UltraEdit\uedit64.exe,0)
                            

2 新建项 Command (修改默认值为 C:\Local\UltraEdit\uedit64.exe %1)
</pre>
</div>
</div>

<div id="outline-container-org7e4eda1" class="outline-4">
<h4 id="org7e4eda1"><span class="section-number-4">2.0.8</span> 文件修改自动加载</h4>
<div class="outline-text-4" id="text-2-0-8">
<pre class="example">
高级 -&gt; 设置 -&gt; 文件处理 -&gt; 文件更改检查 -&gt; 自动更新已经更改的文件
</pre>
</div>
</div>
<div id="outline-container-org4c7b35e" class="outline-4">
<h4 id="org4c7b35e"><span class="section-number-4">2.0.9</span> 设置缩进为4空格(针对每个编程语言)</h4>
<div class="outline-text-4" id="text-2-0-9">
<pre class="example">
高级 -&gt; 设置 -&gt; 编辑器 -&gt; 自动换行制表符设置

选择要设置或默认的扩展名（.c，cpp，.py，.sh，.go）

-&gt; 用空格代替制表符 -&gt; 制表站值（4） -&gt; 缩进空格（4）
</pre>
</div>
</div>
<div id="outline-container-org65b68dc" class="outline-4">
<h4 id="org65b68dc"><span class="section-number-4">2.0.10</span> 修改默认utf-8编码</h4>
<div class="outline-text-4" id="text-2-0-10">
<pre class="example">
高级 -&gt; 设置 -&gt; 文件处理 -&gt; 编码 -&gt; 默认编码UTF-8
</pre>
</div>
</div>

<div id="outline-container-orgca0d25e" class="outline-4">
<h4 id="orgca0d25e"><span class="section-number-4">2.0.11</span> 左侧显示文件视图</h4>
<div class="outline-text-4" id="text-2-0-11">
<pre class="example">
布局 -&gt; 文件视图
</pre>
</div>
</div>
<div id="outline-container-orgae26170" class="outline-4">
<h4 id="orgae26170"><span class="section-number-4">2.0.12</span> 新建文件类型</h4>
<div class="outline-text-4" id="text-2-0-12">
<pre class="example">
高级 -&gt; 设置 -&gt; 文件处理 -&gt; DOS/Unix/Mac处理 -&gt; 新建文件的默认类型 -&gt; UNIX
</pre>
</div>
</div>
</div>
<div id="outline-container-orge075d4d" class="outline-2">
<h2 id="orge075d4d"><span class="section-number-2">3</span> 常用快捷键</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>C-u</li>
</ul>
<pre class="example">
左侧显示文件视图
</pre>

<ul class="org-ul">
<li>C-h</li>
</ul>
<pre class="example">
查看文件的16进制编码
</pre>

<ul class="org-ul">
<li>C-/</li>
</ul>
<pre class="example">
删除行尾空格
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-04-07 周五 09:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
